ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/vs_Доизготовление/vs_Доизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>vs_Доизготовление</name>
  <resources>
    <name>Доизготовить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cc2a9ed0-e83e-4ca4-a99c-1b3eefba4d77">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/СтатусыСборокТоваров/СтатусыСборокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d32e7159-13c4-4ac8-9058-9848ec019475">
  <name>СтатусыСборокТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c5d672fd-488c-4858-89d0-05a9afcde29b">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="73cc6264-ff74-4ff1-a2a7-0fd6e2fc6e85">
    <name>СобраноРазобрано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/Forms/vs_ФормаДоизготовление/Module.bsl
&НаСервере
Процедура vs_АктИзготовленияПриИзмененииНаСервере()
    
    ЗаполнитьТч();
    
КонецПроцедуры

&НаКлиенте
Процедура vs_АктИзготовленияПриИзменении(Элемент)
    
    vs_АктИзготовленияПриИзмененииНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТч()
    
    Объект.Товары.Очистить();   
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	vs_Доизготовление.ДоизготовитьОстаток КАК ТребуетсяДоизготовить,
    |	vs_Доизготовление.АктИзготовления.Номенклатура КАК АналитикаРасходов,
    |	vs_Доизготовление.ДоизготовитьОстаток КАК Количество,
    |	vs_Доизготовление.Номенклатура КАК Номенклатура,
    |	vs_СтатьяДоизготовления.Значение КАК СтатьяРасходов
    |ИЗ
    |	РегистрНакопления.vs_Доизготовление.Остатки(, АктИзготовления = &Акт) КАК vs_Доизготовление,
    |	Константа.vs_СтатьяДоизготовления КАК vs_СтатьяДоизготовления Где vs_Доизготовление.ДоизготовитьОстаток > 0";
    
    Запрос.УстановитьПараметр("Акт", Объект.vs_АктИзготовления);
    Запрос.УстановитьПараметр("Склад", 	Объект.Склад);    // begin fix Designer 10.04.2023 15:56:11
	Запрос.УстановитьПараметр("Дата", Новый Граница(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, КонецДня(ТекущаяДатаСеанса())), ВидГраницы.Включая));
	
	Объект.Дата = Запрос.Параметры.Дата.Значение;
	
	Запрос.Текст = "
    |ВЫБРАТЬ
    |	vs_Доизготовление.АктИзготовления.Номенклатура 	КАК АналитикаРасходов,
    |	vs_СтатьяДоизготовления.Значение 					КАК СтатьяРасходов,
    |	vs_Доизготовление.Номенклатура 					КАК Номенклатура,
    |	ТоварыНаСкладахОстатки.Характеристика 				КАК Характеристика,
    |	ТоварыНаСкладахОстатки.Серия 						КАК Серия,
	|	ТоварыНаСкладахОстатки.Назначение 					КАК Назначение,
	|	vs_Доизготовление.ДоизготовитьОстаток 			КАК ТребуетсяДоизготовить,
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток,0) < ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)
    |			ТОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток,0)
    |		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)
    |	КОНЕЦ 												КАК Количество,
	|	0 													КАК Отказ,
	|	СпрВидыНоменклатуры.ИспользоватьСерии 				КАК ИспользуютсяСерии
    |ИЗ
    |	РегистрНакопления.vs_Доизготовление.Остатки(&Дата, АктИзготовления = &Акт) КАК vs_Доизготовление
    |		ЛЕВОЕ СОЕДИНЕНИЕ Константа.vs_СтатьяДоизготовления КАК vs_СтатьяДоизготовления
    |		ПО (ИСТИНА)
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Склад = &Склад) КАК ТоварыНаСкладахОстатки
    |		ПО (vs_Доизготовление.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
	|				ПО (СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка)
	|			ПО (vs_Доизготовление.Номенклатура = СпрНоменклатура.Ссылка)
    |ГДЕ
    |	vs_Доизготовление.ДоизготовитьОстаток > 0
	|	И ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) >= 0
    |
    |УПОРЯДОЧИТЬ ПО
    |	Номенклатура,
    |	Характеристика,
	|   Серия,
	|   ТребуетсяДоизготовить,
    |	Количество ";	// УБЫВ  
	
	//|	vs_Доизготовление.ДоизготовитьОстаток -
	//|	ЕСТЬNULL(ВЫБОР
	//|		КОГДА vs_Доизготовление.ДоизготовитьОстаток < ТоварыНаСкладахОстатки.ВНаличииОстаток
	//|			ТОГДА vs_Доизготовление.ДоизготовитьОстаток
	//|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	//|	КОНЕЦ,0) КАК Отказ
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	сч = ТЗ.Количество();
	ИспользованныйОтбор = Новый ТаблицаЗначений();
	ИспользованныйОтбор.Колонки.Добавить("Номенклатура");
	ИспользованныйОтбор.Колонки.Добавить("Характеристика");
	Пока сч>0 Цикл
		сч = сч - 1;
		Если Не ТЗ[сч].ИспользуютсяСерии Тогда Продолжить; КонецЕсли;
		С = Новый Структура();
		С.Вставить("Номенклатура", ТЗ[сч].Номенклатура);
		С.Вставить("Характеристика", ТЗ[сч].Характеристика);
		Если ИспользованныйОтбор.НайтиСтроки(С).Количество() Тогда
			Продолжить;
		КонецЕсли;
		ИскКол = ТЗ[сч].ТребуетсяДоизготовить;
		ИскСтр = ТЗ.НайтиСтроки(С);
		Если ИскСтр.Количество() = 1 Тогда 
			Если ИскКол = 1 Тогда 
				Продолжить; 
			КонецЕсли;
			Для поз=2 По ИскКол Цикл
				НСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр,ИскСтр[0]);
				НСтр.ТребуетсяДоизготовить=1;	
			КонецЦикла;
			Продолжить; 
		КонецЕсли;
		 
		Для каждого Стр Из ИскСтр Цикл
			Если ИскКол = 0 Тогда
				ТЗ.Удалить(Стр);
				Продолжить;
			КонецЕсли;
			ИскКол = ИскКол - Стр.Количество;
			Если ИскКол <= 0 Тогда
				Стр.Количество = Стр.Количество + ИскКол;
				Стр.ТребуетсяДоизготовить = Стр.Количество;
				ИскКол = 0;
			Иначе
				Стр.ТребуетсяДоизготовить = Стр.Количество;	
			КонецЕсли;
			Если Стр.Количество = 0 Тогда
				ТЗ.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;
		Если ИскКол > 0 Тогда
			Для поз=1 По ИскКол Цикл
				НСтр = ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НСтр,ИскСтр[0]);
				НСтр.ТребуетсяДоизготовить=1;	
			КонецЦикла;	
		КонецЕсли;	
		сч = Мин(Сч,ТЗ.Количество());
		СТЗ=ИспользованныйОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(СТЗ,С);
	КонецЦикла;
	С = Новый Структура();
	С.Вставить("ТребуетсяДоизготовить", 0);
	ИскСтр = ТЗ.НайтиСтроки(С);
	Для каждого Стр Из ИскСтр Цикл
		ТЗ.Удалить(Стр);
	КонецЦикла;
    Объект.vs_Доизготовление.Загрузить(ТЗ);
	Объект.ИТБК_Доизготовление.Загрузить(ТЗ);
   	// end fix Designer 10.04.2023 15:56:22 
    
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    Если объект.Ссылка.Пустая() тогда
        Объект.vs_ЭтоДоизготовление = Истина;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
        Возврат;
    КонецЕсли;
    
    ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
    
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
    
	ПриЧтенииСозданииНаСервере();   // fix Designer09.09.2021 4:40:58
    
    Если Элементы.ХозяйственнаяОперация.СписокВыбора.Количество() = 1 Тогда
        Элементы.ХозяйственнаяОперация.Видимость = Ложь;
    КонецЕсли;
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    // ИнтеграцияС1СДокументооборотом
    ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
    // Конец ИнтеграцияС1СДокументооборотом
    
	// Выбор статей и аналитик.
	//ПараметрыВыбораСтатейИАналитик = Документы.ВнутреннееПотребление.ПараметрыВыбораСтатейИАналитик(Объект.ХозяйственнаяОперация);
	//ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	// Выбор статей и аналитик.
	ПараметрыВыбораСтатейИАналитик = Документы.ВнутреннееПотребление.ПараметрыВыбораСтатейИАналитик_vs_Доизготовление(Объект.ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
    ВнутреннееПотреблениеЛокализация.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
    
    СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("ПараметрКоманды") тогда
		объект.vs_АктИзготовления = Параметры.ПараметрКоманды; 
		объект.ИТБК_АктИзготовления = Параметры.ПараметрКоманды;
		объект.Склад = объект.vs_АктИзготовления.Склад;
		объект.Организация = объект.vs_АктИзготовления.Организация;
		объект.Подразделение = объект.vs_АктИзготовления.Подразделение;
		vs_АктИзготовленияПриИзмененииНаСервере();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры


&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеПередУдалением(Элемент, Отказ)
//    Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура vs_ДоизготовлениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 Если Копирование тогда   Отказ = Истина;  КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура vs_ДоизготовлениеОтказПриИзменении(Элемент) 
	ТД = Элементы.vs_Доизготовление.ТекущиеДанные ;
	Если не ЗначениеЗаполнено(ТД.Серия) Тогда
	   	Если ТД.Отказ <> 0 и ТД.Отказ > ТД.ТребуетсяДоизготовить - ТД.Количество тогда
	        ТД.Отказ  =  ТД.ТребуетсяДоизготовить - ТД.Количество ;
			ПоказатьПредупреждение(,"Значение количества в столбце  ""Отказ""  не может  превышать  расчетного значения  
			|(разница количества  в  столбцах ""Требуется доизготовить""  и ""Доизготовить""), 
			|уменьшите количество в столбце ""Отказ"" до необходимого расчетного значения!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура vs_СтатусПриИзмененииНаСервере()
	Элементы.ГруппаОсновное.ТолькоПросмотр = объект.vs_Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;	
	Элементы.vs_Доизготовление.ТолькоПросмотр = объект.vs_Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;	
	Если Элементы.vs_Доизготовление.ТолькоПросмотр Тогда
		Объект.Товары.Очистить();
		Объект.Серии.Очистить();
		Объект.ВидыЗапасов.Очистить();
		ТЗ = Объект.vs_Доизготовление.Выгрузить();
		ТЗ.Свернуть("Номенклатура,Характеристика,Серия,СтатьяРасходов,АналитикаРасходов,Назначение","Количество");
		Отбор = Новый Структура("Количество",0);
		ИскСтр = ТЗ.НайтиСтроки(Отбор);
		Для Каждого Стр Из ИскСтр Цикл
			ТЗ.Удалить(Стр);
		КонецЦикла;
		Объект.Товары.Загрузить(ТЗ);
		Для Каждого Стр из Объект.Товары Цикл
			Стр.КоличествоУпаковок = Стр.Количество;
			Если ЗначениеЗаполнено(Стр.Серия) Тогда
				Стр.СтатусУказанияСерий  			= 4;
				Стр.СтатусУказанияСерийОтправитель 	= 4; 					// fix Designer 14.02.2023 16:45:13
				НовСтр                      		= Объект.Серии.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_СтатусПриИзменении(Элемент)
	vs_СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	vs_СтатусПриИзмененииНаСервере();
	ПриЧтенииСозданииНаСервере();  // fix Designer09.09.2021 4:38:28
КонецПроцедуры

//&НаКлиенте
//Процедура vs_ДоизготовлениеДоизготовлениеПриИзменении(Элемент)
//    
//	//Если  Элементы.vs_Доизготовление.ТекущиеДанные.Количество + Элементы.vs_Доизготовление.ТекущиеДанные.Отказ >  Элементы.vs_Доизготовление.ТекущиеДанные.ТребуетсяДоизготовить  тогда
//	//    Элементы.vs_Доизготовление.ТекущиеДанные.Количество  = Элементы.vs_Доизготовление.ТекущиеДанные.ТребуетсяДоизготовить - Элементы.vs_Доизготовление.ТекущиеДанные.Отказ;
//	//КонецЕсли;
//КонецПроцедуры

// begin fix Designer09.09.2021 4:28:49

&НаСервере
Процедура ИзменитьЗаголовок()
	
	АвтоЗаголовок = Истина;
	Заголовок = "";
	АвтоЗаголовок = Ложь;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Доизготовление %1 от %2'"),
			Объект.Номер,
			Объект.Дата);
	Иначе
		Заголовок = НСтр("ru = 'Доизготовление (создание)'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ИзменитьЗаголовок();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ИзменитьЗаголовок(); 
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.vs_Доизготовление.ТолькоПросмотр = Ложь Тогда
		ТД = Элемент.ТекущиеДанные;
		ТЭ = Элемент.ТекущийЭлемент;
		Если Не ТД = Неопределено Тогда
			Если Не ТД.ИспользуютсяСерии 
				и ТЭ.Имя = "vs_ДоизготовлениеСерия" Тогда
				Отказ = Истина;
			ИначеЕсли ТД.ИспользуютсяСерии 
				и ТЭ.Имя = "vs_ДоизготовлениеСерия"
				и Не ЗначениеЗаполнено(ТД.Серия) Тогда
			   	Отказ = Ложь;
			ИначеЕсли ЗначениеЗаполнено(ТД.Серия) 
				и ТЭ.Имя = "vs_ДоизготовлениеКоличество" Тогда
				ТД.Количество = Мин(Элемент.ТекущиеДанные.Количество,1); 
			ИначеЕсли ЗначениеЗаполнено(ТД.Серия) 
				и ТЭ.Имя = "vs_ДоизготовлениеОтказ" Тогда
				ТД.Отказ = Мин(ТД.Отказ,1);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ТД.ТребуетсяДоизготовить) 
				и ТЭ.Имя = "vs_ДоизготовлениеОтказ" Тогда
				ТД.Отказ = 0;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Элементы.vs_Доизготовление.ТолькоПросмотр = Ложь Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) 
			и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеДоизготовление" 
			и (Элемент.ТекущиеДанные.Количество > 1 
			или Элемент.ТекущиеДанные.Количество + Элемент.ТекущиеДанные.Отказ > 1) Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Нельзя для экземплярного товара указывать значение в сумме колонок ""Количество"" и ""Отказ"" больше 1.'"),30);
			Отказ = Истина;
		ИначеЕсли ЗначениеЗаполнено(Элемент.ТекущиеДанные.Серия) 
			и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеОтказ" 
			и (Элемент.ТекущиеДанные.Отказ > 1 
			или Элемент.ТекущиеДанные.Количество + Элемент.ТекущиеДанные.Отказ > 1) Тогда
			ПоказатьПредупреждение(,НСтр("ru = 'Нельзя для экземплярного товара указывать значение в сумме колонок ""Количество"" и ""Отказ"" больше 1.'"),30);
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	////Объект.Товары.Очистить();
	//Кол = Объект.Товары.Количество() - 1;
	//Для Ном = 0 По Кол Цикл
	//	Объект.Товары.Удалить(Кол - Ном);
	//КонецЦикла;
	////Объект.Серии.Очистить();
	//Кол = Объект.Серии.Количество() - 1;
	//Для Ном = 0 По Кол Цикл
	//	Объект.Серии.Удалить(Кол - Ном);
	//КонецЦикла;
	//
	//// fix Designer 23.05.2025 4:00:58

	//для Каждого стр из Объект.vs_Доизготовление Цикл
	//	
	//	Если стр.Количество > 0 Тогда   
	//		стрТовары = Объект.Товары.Добавить();
	//		ЗаполнитьЗначенияСвойств(стрТовары,стр);
	//		//стрТовары = Объект.Товары.Добавить();
	//		//стрТовары.Номенклатура = стр.Номенклатура;
	//		//стрТовары.Характеристика = стр.Характеристика;     						// fix Designer 14.02.2023 16:45:13
	//		стрТовары.КоличествоУпаковок = стр.Количество;
	//		//стрТовары.Количество = стр.Количество;
	//		//стрТовары.СтатьяРасходов = стр.СтатьяРасходов;
	//		//стрТовары.АналитикаРасходов = стр.АналитикаРасходов;
	//		//стрТовары.Назначение = стр.Назначение;     								// fix Designer 14.02.2023 16:45:13
	//		
	//		Если ЗначениеЗаполнено(стр.Серия) тогда
	//			стрТовары.СтатусУказанияСерий  				= 4;
	//			стрТовары.СтатусУказанияСерийОтправитель 	= 4; 					// fix Designer 14.02.2023 16:45:13
	//			НовСтр                      				= Объект.Серии.Добавить();
	//			ЗаполнитьЗначенияСвойств(НовСтр,стр);
	//			//НовСтр.Номенклатура        				= стр.Номенклатура;
	//			//НовСтр.Характеристика 					= стр.Характеристика;  	// fix Designer 14.02.2023 16:45:13
	//			//НовСтр.Серия                				= стр.Серия;
	//			//НовСтр.Назначение 						= стр.Назначение;     	// fix Designer 14.02.2023 16:45:13
	//			//НовСтр.Количество           				= стр.Количество;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ИТБК_ЭтоДоизготовление	 = Объект.vs_ЭтоДоизготовление;
	ТекущийОбъект.ИТБК_АктИзготовления	 	 = Объект.vs_АктИзготовления;
	ТекущийОбъект.ИТБК_Статус				 = Объект.vs_Статус;
	ТекущийОбъект.ИТБК_Доизготовление.Загрузить(Объект.vs_Доизготовление.Выгрузить());
	
	Ошибки = Неопределено;
	для Каждого стр из ТекущийОбъект.vs_Доизготовление Цикл
		Если стр.Количество + стр.Отказ > стр.ТребуетсяДоизготовить 
			и стр.ТребуетсяДоизготовить > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.vs_Доизготовление[%1].ТребуетсяДоизготовить", СтрШаблон("(Количество + Отказ) строка %1 > Требуется доизготовить",стр.НомерСтроки),,(стр.НомерСтроки+1));
		КонецЕсли;
		//Если (Стр.Отказ < Стр.Количество 
		//		или Стр.Отказ - Стр.Количество < Стр.ТребуетсяДоизготовить)
		//		и Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(Стр.Номенклатура.ВидНоменклатуры).ИспользоватьСерии и не значениеЗаполнено(Стр.Серия) тогда
		//	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.vs_Доизготовление[%1].Серия", СтрШаблон("Не заполнена серия по номенклатуре %1", стр.Номенклатура),,(стр.НомерСтроки+1));
		//КонецЕсли;
	КонецЦикла;
	Если Не Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеСерияНачалоВыбора1(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
	ТС = Элементы.vs_Доизготовление.ТекущиеДанные;
	Если ТС = Неопределено тогда Возврат КонецЕсли;
	Если ТС.ИспользуютсяСерии Тогда
	    ОткрытьФорму("Обработка.vs_Автоизготовление.Форма.выборСерии",новый Структура("Ном",ТС.Номенклатура),Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеПриАктивизацииПоля(Элемент)
	//Если Элементы.vs_Доизготовление.ТолькоПросмотр = Ложь Тогда
	//	Если Элемент.Имя = "vs_Доизготовление"
	//		и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеСерия"
	//		и Не Элемент.ТекущиеДанные.ИспользуютсяСерии Тогда
	//		Возврат;
	//	ИначеЕсли Элемент.Имя = "vs_Доизготовление"
	//		и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеОтказ"
	//		и Элемент.ТекущиеДанные.ТребуетсяДоизготовить = 0 Тогда
	//		Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
	//	ИначеЕсли Элемент.Имя = "vs_Доизготовление"
	//		и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеТребуетсяДоизготовить" Тогда
	//		Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
	//	Иначе
	//		Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
	//	КонецЕсли;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.vs_Доизготовление.ТолькоПросмотр = Ложь Тогда
		Если Элемент.Имя = "vs_Доизготовление"
			и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеОтказ"
			и Элемент.ТекущиеДанные.ТребуетсяДоизготовить = 0 Тогда
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
			Элемент.ТекущиеДанные.Отказ = 0;
		ИначеЕсли Элемент.Имя = "vs_Доизготовление"
			и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеТребуетсяДоизготовить" Тогда
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
		Иначе
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеКоличествоПриИзменении(Элемент)
	ТС = Элементы.vs_Доизготовление.ТекущиеДанные;
	Если ТС = Неопределено Тогда Возврат КонецЕсли;
	Если ЗначениеЗаполнено(ТС.Серия) и ТС.Количество > 1 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нельзя для экземплярного товара указывать значение ""Доизготовить"" больше 1.'"),30);
		ТС.Количество = 1;	
	КонецЕсли;
КонецПроцедуры

&Насервере
Функция  ИспользуютсяСерии(Номенклатура)
	
	возврат Номенклатура.ВидНоменклатуры.ИспользоватьСерии;
	
КонецФункции

&НаКлиенте
Процедура vs_ДоизготовлениеПриАктивизацииЯчейки(Элемент)
	Если Элемент.ТолькоПросмотр Тогда Возврат; КонецЕсли;
	ТД = Элемент.ТекущиеДанные;
	ТЭ = Элемент.ТекущийЭлемент;
	Если ТД = Неопределено Тогда Возврат КонецЕсли;

	Элементы.vs_ДоизготовлениеСерия.ТолькоПросмотр = Не (ТД.ИспользуютсяСерии);
	//Если ТД.ИспользуютсяСерии Тогда
	//    ОткрытьФорму("Обработка.vs_Автоизготовление.Форма.выборСерии",новый Структура("Ном",ТД.Номенклатура),Элемент);
	//КонецЕсли;
	Если Элемент.Имя = "vs_Доизготовление"
		и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеСерия"
		и Не Элемент.ТекущиеДанные.ИспользуютсяСерии Тогда
		Возврат;
	ИначеЕсли Элемент.Имя = "vs_Доизготовление"
		и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеОтказ"
		и Элемент.ТекущиеДанные.ТребуетсяДоизготовить = 0 Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
	ИначеЕсли Элемент.Имя = "vs_Доизготовление"
		и Элемент.ТекущийЭлемент.Имя = "vs_ДоизготовлениеТребуетсяДоизготовить" Тогда
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
	Иначе
		Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеПриАктивизацииСтроки(Элемент)
	ТД =  Элементы.vs_Доизготовление.ТекущиеДанные ;
	Если ТД = Неопределено тогда Возврат КонецЕсли;
	Элементы.vs_ДоизготовлениеСерия.ТолькоПросмотр = не (ТД.ИспользуютсяСерии);
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеНоменклатураПриИзменении(Элемент)
	ТС = Элементы.vs_Доизготовление.ТекущаяСтрока;
	Если ТС = Неопределено тогда Возврат КонецЕсли;;
	vs_ДоизготовлениеНоменклатураПриИзмененииНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура vs_ДоизготовлениеНоменклатураПриИзмененииНаСервере(ИД)
	ТС = объект.vs_Доизготовление.НайтиПоИдентификатору(ИД);
	//Если не ЗначениеЗаполнено(ТС.СтатьяРасходов) тогда
	//	ТС.СтатьяРасходов = Константы.vs_СтатьяДоизготовления.Получить();
	//	ТС.АналитикаРасходов =  ?(объект.vs_АктИзготовления <> Неопределено, объект.vs_АктИзготовления.Номенклатура,Неопределено);
	//КонецЕсли;
	ТС.ИспользуютсяСерии = ИспользуютсяСерии(ТС.Номенклатура) ;
	ТС.Серия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	Если Не ТС.ИспользуютсяСерии
		и не ЗначениеЗаполнено(ТС.СтатьяРасходов)Тогда
		ТС.СтатьяРасходов = Константы.vs_СтатьяДоизготовления.Получить();
		ТС.АналитикаРасходов =  ?(объект.vs_АктИзготовления <> Неопределено, объект.vs_АктИзготовления.Номенклатура,Неопределено); 
		Элементы.vs_Доизготовление.ТекущийЭлемент = Элементы.vs_ДоизготовлениеКоличество;
	ИначеЕсли Не ТС.ИспользуютсяСерии Тогда
		Элементы.vs_Доизготовление.ТекущийЭлемент = Элементы.vs_ДоизготовлениеКоличество;
	ИначеЕсли ТС.ИспользуютсяСерии Тогда
		Элементы.vs_Доизготовление.ТекущийЭлемент = Элементы.vs_ДоизготовлениеСерия;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура vs_ДоизготовлениеСерияПриИзменении(Элемент)
	ТС = Элементы.vs_Доизготовление.ТекущаяСтрока;
	Если ТС = Неопределено тогда Возврат КонецЕсли;;
	vs_ДоизготовлениеСерияПриИзмененииНаСервере(ТС);
КонецПроцедуры

&НаСервере
Процедура vs_ДоизготовлениеСерияПриИзмененииНаСервере(ИД)
	ТС = объект.vs_Доизготовление.НайтиПоИдентификатору(ИД);
	Если Не ЗначениеЗаполнено(ТС.СтатьяРасходов)Тогда
		ТС.СтатьяРасходов = Константы.vs_СтатьяДоизготовления.Получить();
		ТС.АналитикаРасходов =  ?(объект.vs_АктИзготовления <> Неопределено, объект.vs_АктИзготовления.Номенклатура,Неопределено);
		Элементы.vs_Доизготовление.ТекущийЭлемент = Элементы.vs_ДоизготовлениеКоличество;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.vs_ЭтоДоизготовление Тогда
		ПроверяемыеРеквизиты.Добавить("vs_Статус");
		
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//Ошибки = Неопределено;
		Для Каждого Стр из Объект.vs_Доизготовление Цикл
			Если Стр.Отказ > Стр.Количество 
				и Стр.Отказ - Стр.Количество > Стр.ТребуетсяДоизготовить Тогда
				Модифицированность = Истина;
				Прервать;
				//ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Объект, СтрШаблон("Отказ > Требуется доизготовить! Номенлатура %1", Стр.Номенклатура),,Стр.НомерСтроки);
			КонецЕсли;
		КонецЦикла;
		//Если Не Ошибки = Неопределено Тогда
		//	Модифицированность = истина;
		//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		//КонецЕсли;
		/////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		//Если Не ЗначениеЗаполнено(Объект.vs_Статус) Тогда
		//	Ошибки = Неопределено;
		//	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, Объект, "Статус не заполнен!");
		//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);		
		//    Возврат;
		//КонецЕсли;	
		
		//Объект.Товары.Очистить();
		//Объект.Серии.Очистить();
		//для Каждого стр из Объект.vs_Доизготовление Цикл
		//	
		//	Если стр.Количество > 0  тогда
		//		
		//		Если стр.Номенклатура.видноменклатуры.ИспользоватьСерии и стр.Серия.Пустая() тогда
		//			//ОбщегоНазначения.СообщитьПользователю("Не заполнена серия " + стр.Номенклатура,ЭтотОбъект,"","",Отказ); // begin fix Designer09.09.2021 4:04:42
		//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнена серия %1", стр.Номенклатура), Объект,"","",Отказ);// end fix Designer09.09.2021 4:04:53
		//		КонецЕсли;
		//		
		//		стрТовары = Объект.Товары.Добавить();
		//		стрТовары.Номенклатура = стр.Номенклатура;
		//		стрТовары.Характеристика = стр.Характеристика;     						// fix Designer 14.02.2023 16:45:13
		//		стрТовары.КоличествоУпаковок = стр.Количество;
		//		стрТовары.Количество = стр.Количество;
		//		стрТовары.СтатьяРасходов = стр.СтатьяРасходов;
		//		стрТовары.АналитикаРасходов = стр.АналитикаРасходов;
		//		стрТовары.Назначение = стр.Назначение;     								// fix Designer 14.02.2023 16:45:13
		//		
		//		Если ЗначениеЗаполнено(стр.Серия) тогда
		//			стрТовары.СтатусУказанияСерий  				= 4;
		//			стрТовары.СтатусУказанияСерийОтправитель 	= 4; 					// fix Designer 14.02.2023 16:45:13
		//			НовСтр                      				= Объект.Серии.Добавить();
		//			НовСтр.Номенклатура        					= стр.Номенклатура;
		//			НовСтр.Характеристика 						= стр.Характеристика;  	// fix Designer 14.02.2023 16:45:13
		//			НовСтр.Серия                				= стр.Серия;
		//			НовСтр.Назначение 							= стр.Назначение;     	// fix Designer 14.02.2023 16:45:13
		//			НовСтр.Количество           				= стр.Количество;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Непорядок в документе %1", Строка(Объект)), Объект,"","",Отказ);// end fix Designer09.09.2021 4:04:53
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры



// end fix Designer09.09.2021 4:29:07

//&НаКлиенте
//Процедура vs_ДоизготовлениеСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//		СтандартнаяОбработка = Ложь;
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.vs_Доизготовление.ТекущаяСтрока);
//	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Статья", Элементы.vs_Доизготовление.ТекущиеДанные.СтатьяРасходов);
//	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);
//	
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

//КонецПроцедуры


//&НаКлиенте
//Процедура vs_ДоизготовлениеАналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

//КонецПроцедуры

//&НаКлиенте
//Процедура СтатьяРасходовВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Строка = Объект.vs_Доизготовление.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
//	Строка.СтатьяРасходов = Результат;
//	ТоварыСтатьяРасходовПриИзмененииСервер();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ТоварыСтатьяРасходовПриИзмененииСервер()
//	
//	СтрокаТаблицы = Объект.vs_Доизготовление.НайтиПоИдентификатору(Элементы.vs_Доизготовление.ТекущаяСтрока);
//	
//	Если ТипЗнч(СтрокаТаблицы.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
//		ДоходыИРасходыСервер.СтатьяАктивовПассивовПриИзменении(Объект, СтрокаТаблицы.СтатьяРасходов, СтрокаТаблицы.АналитикаАктивовПассивов);
//		Если ЗначениеЗаполнено(СтрокаТаблицы.АналитикаРасходов) Тогда
//			СтрокаТаблицы.АналитикаРасходов = Неопределено;
//			СтрокаТаблицы.АналитикаРасходовОбязательна = Ложь;
//			СтрокаТаблицы.АналитикаРасходовЗаказРеализация = Ложь;
//		КонецЕсли;
//	Иначе
//		ДоходыИРасходыСервер.СтатьяРасходовПриИзменении(Объект, СтрокаТаблицы.СтатьяРасходов, СтрокаТаблицы.АналитикаРасходов);
//		Если ЗначениеЗаполнено(СтрокаТаблицы.АналитикаАктивовПассивов) Тогда
//			СтрокаТаблицы.АналитикаАктивовПассивов = Неопределено;
//		КонецЕсли;
//	КонецЕсли;
//	
//	СтруктураДействий = Новый Структура("
//		|ЗаполнитьПризнакАналитикаРасходовОбязательна,
//		|ЗаполнитьПризнакАналитикаРасходовЗаказРеализация,
//		|ЗаполнитьТипСтатьи");
//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, Неопределено);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура vs_ДоизготовлениеСтатьяРасходовПриИзменении(Элемент)
//		ТоварыСтатьяРасходовПриИзмененииСервер();

//КонецПроцедуры
